apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
/****************************************************************************
 * arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_I2C_H
#define __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_I2C_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s2_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* I2C_SCL_LOW_PERIOD_REG register
 * Configures the low level width of the SCL clock
 */

#define I2C_SCL_LOW_PERIOD_REG(i) (REG_I2C_BASE(i) + 0x0)

/* I2C_SCL_LOW_PERIOD : R/W; bitpos: [13:0]; default: 0;
 * This register is used to configure for how long SCL remains low in master
 * mode, in I2C module clock cycles.
 */

#define I2C_SCL_LOW_PERIOD    0x00003fff
#define I2C_SCL_LOW_PERIOD_M  (I2C_SCL_LOW_PERIOD_V << I2C_SCL_LOW_PERIOD_S)
#define I2C_SCL_LOW_PERIOD_V  0x00003fff
#define I2C_SCL_LOW_PERIOD_S  0

/* I2C_CTR_REG register
 * Transmission setting
 */

#define I2C_CTR_REG(i) (REG_I2C_BASE(i) + 0x4)

/* I2C_REF_ALWAYS_ON : R/W; bitpos: [11]; default: 1;
 * This register is used to control the REF_TICK.
 */

#define I2C_REF_ALWAYS_ON    (BIT(11))
#define I2C_REF_ALWAYS_ON_M  (I2C_REF_ALWAYS_ON_V << I2C_REF_ALWAYS_ON_S)
#define I2C_REF_ALWAYS_ON_V  0x00000001
#define I2C_REF_ALWAYS_ON_S  11

/* I2C_FSM_RST : R/W; bitpos: [10]; default: 0;
 * This register is used to reset the SCL_FSM.
 */

#define I2C_FSM_RST    (BIT(10))
#define I2C_FSM_RST_M  (I2C_FSM_RST_V << I2C_FSM_RST_S)
#define I2C_FSM_RST_V  0x00000001
#define I2C_FSM_RST_S  10

/* I2C_ARBITRATION_EN : R/W; bitpos: [9]; default: 1;
 * This is the enable bit for I2C bus arbitration function.
 */

#define I2C_ARBITRATION_EN    (BIT(9))
#define I2C_ARBITRATION_EN_M  (I2C_ARBITRATION_EN_V << I2C_ARBITRATION_EN_S)
#define I2C_ARBITRATION_EN_V  0x00000001
#define I2C_ARBITRATION_EN_S  9

/* I2C_CLK_EN : R/W; bitpos: [8]; default: 0;
 * Reserved.
 */

#define I2C_CLK_EN    (BIT(8))
#define I2C_CLK_EN_M  (I2C_CLK_EN_V << I2C_CLK_EN_S)
#define I2C_CLK_EN_V  0x00000001
#define I2C_CLK_EN_S  8

/* I2C_RX_LSB_FIRST : R/W; bitpos: [7]; default: 0;
 * This bit is used to control the storage mode for received data.
 *
 * 1: receive data from the least significant bit.
 *
 * 0: receive data from the most significant bit.
 */

#define I2C_RX_LSB_FIRST    (BIT(7))
#define I2C_RX_LSB_FIRST_M  (I2C_RX_LSB_FIRST_V << I2C_RX_LSB_FIRST_S)
#define I2C_RX_LSB_FIRST_V  0x00000001
#define I2C_RX_LSB_FIRST_S  7

/* I2C_TX_LSB_FIRST : R/W; bitpos: [6]; default: 0;
 * This bit is used to control the sending mode for data needing to be sent.
 *
 * 1: send data from the least significant bit.
 *
 * 0: send data from the most significant bit.
 */

#define I2C_TX_LSB_FIRST    (BIT(6))
#define I2C_TX_LSB_FIRST_M  (I2C_TX_LSB_FIRST_V << I2C_TX_LSB_FIRST_S)
#define I2C_TX_LSB_FIRST_V  0x00000001
#define I2C_TX_LSB_FIRST_S  6

/* I2C_TRANS_START : R/W; bitpos: [5]; default: 0;
 * Set this bit to start sending the data in TX FIFO.
 */

#define I2C_TRANS_START    (BIT(5))
#define I2C_TRANS_START_M  (I2C_TRANS_START_V << I2C_TRANS_START_S)
#define I2C_TRANS_START_V  0x00000001
#define I2C_TRANS_START_S  5

/* I2C_MS_MODE : R/W; bitpos: [4]; default: 0;
 * Set this bit to configure the module as an I2C Master. Clear this bit to
 * configure the module as an I2C Slave.
 */

#define I2C_MS_MODE    (BIT(4))
#define I2C_MS_MODE_M  (I2C_MS_MODE_V << I2C_MS_MODE_S)
#define I2C_MS_MODE_V  0x00000001
#define I2C_MS_MODE_S  4

/* I2C_RX_FULL_ACK_LEVEL : R/W; bitpos: [3]; default: 1;
 * This register is used to configure the ACK value that need to sent by
 * master when the rx_fifo_cnt has reached the threshold.
 */

#define I2C_RX_FULL_ACK_LEVEL    (BIT(3))
#define I2C_RX_FULL_ACK_LEVEL_M  (I2C_RX_FULL_ACK_LEVEL_V << I2C_RX_FULL_ACK_LEVEL_S)
#define I2C_RX_FULL_ACK_LEVEL_V  0x00000001
#define I2C_RX_FULL_ACK_LEVEL_S  3

/* I2C_SAMPLE_SCL_LEVEL : R/W; bitpos: [2]; default: 0;
 * This register is used to select the sample mode.
 *
 * 1: sample SDA data on the SCL low level.
 *
 * 0: sample SDA data on the SCL high level.
 */

#define I2C_SAMPLE_SCL_LEVEL    (BIT(2))
#define I2C_SAMPLE_SCL_LEVEL_M  (I2C_SAMPLE_SCL_LEVEL_V << I2C_SAMPLE_SCL_LEVEL_S)
#define I2C_SAMPLE_SCL_LEVEL_V  0x00000001
#define I2C_SAMPLE_SCL_LEVEL_S  2

/* I2C_SCL_FORCE_OUT : R/W; bitpos: [1]; default: 1;
 * 0: direct output. 1: open drain output.
 */

#define I2C_SCL_FORCE_OUT    (BIT(1))
#define I2C_SCL_FORCE_OUT_M  (I2C_SCL_FORCE_OUT_V << I2C_SCL_FORCE_OUT_S)
#define I2C_SCL_FORCE_OUT_V  0x00000001
#define I2C_SCL_FORCE_OUT_S  1

/* I2C_SDA_FORCE_OUT : R/W; bitpos: [0]; default: 1;
 * 0: direct output. 1: open drain output.
 */

#define I2C_SDA_FORCE_OUT    (BIT(0))
#define I2C_SDA_FORCE_OUT_M  (I2C_SDA_FORCE_OUT_V << I2C_SDA_FORCE_OUT_S)
#define I2C_SDA_FORCE_OUT_V  0x00000001
#define I2C_SDA_FORCE_OUT_S  0

/* I2C_SR_REG register
 * Describe I2C work status
 */

#define I2C_SR_REG(i) (REG_I2C_BASE(i) + 0x8)

/* I2C_SCL_STATE_LAST : RO; bitpos: [30:28]; default: 0;
 * This field indicates the states of the state machine used to produce SCL.
 *
 * 0: Idle. 1: Start. 2: Negative edge. 3: Low. 4: Positive edge. 5: High.
 * 6: Stop
 */

#define I2C_SCL_STATE_LAST    0x00000007
#define I2C_SCL_STATE_LAST_M  (I2C_SCL_STATE_LAST_V << I2C_SCL_STATE_LAST_S)
#define I2C_SCL_STATE_LAST_V  0x00000007
#define I2C_SCL_STATE_LAST_S  28

/* I2C_SCL_MAIN_STATE_LAST : RO; bitpos: [26:24]; default: 0;
 * This field indicates the states of the I2C module state machine.
 *
 * 0: Idle. 1: Address shift. 2: ACK address. 3: RX data. 4: TX data. 5:
 * Send ACK. 6: Wait ACK
 */

#define I2C_SCL_MAIN_STATE_LAST    0x00000007
#define I2C_SCL_MAIN_STATE_LAST_M  (I2C_SCL_MAIN_STATE_LAST_V << I2C_SCL_MAIN_STATE_LAST_S)
#define I2C_SCL_MAIN_STATE_LAST_V  0x00000007
#define I2C_SCL_MAIN_STATE_LAST_S  24

