apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
/* I2C_TXFIFO_CNT : RO; bitpos: [23:18]; default: 0;
 * This field stores the amount of received data in RAM.
 */

#define I2C_TXFIFO_CNT    0x0000003f
#define I2C_TXFIFO_CNT_M  (I2C_TXFIFO_CNT_V << I2C_TXFIFO_CNT_S)
#define I2C_TXFIFO_CNT_V  0x0000003f
#define I2C_TXFIFO_CNT_S  18

/* I2C_STRETCH_CAUSE : RO; bitpos: [15:14]; default: 0;
 * The cause of stretching SCL low in slave mode. 0:  stretching SCL low at
 * the beginning of I2C read data state. 1: stretching SCL low when I2C TX
 * FIFO is empty in slave mode. 2: stretching SCL low when I2C RX FIFO is
 * full in slave mode.
 */

#define I2C_STRETCH_CAUSE    0x00000003
#define I2C_STRETCH_CAUSE_M  (I2C_STRETCH_CAUSE_V << I2C_STRETCH_CAUSE_S)
#define I2C_STRETCH_CAUSE_V  0x00000003
#define I2C_STRETCH_CAUSE_S  14

/* I2C_RXFIFO_CNT : RO; bitpos: [13:8]; default: 0;
 * This field represents the amount of data needed to be sent.
 */

#define I2C_RXFIFO_CNT    0x0000003f
#define I2C_RXFIFO_CNT_M  (I2C_RXFIFO_CNT_V << I2C_RXFIFO_CNT_S)
#define I2C_RXFIFO_CNT_V  0x0000003f
#define I2C_RXFIFO_CNT_S  8

/* I2C_BYTE_TRANS : RO; bitpos: [6]; default: 0;
 * This field changes to 1 when one byte is transferred.
 */

#define I2C_BYTE_TRANS    (BIT(6))
#define I2C_BYTE_TRANS_M  (I2C_BYTE_TRANS_V << I2C_BYTE_TRANS_S)
#define I2C_BYTE_TRANS_V  0x00000001
#define I2C_BYTE_TRANS_S  6

/* I2C_SLAVE_ADDRESSED : RO; bitpos: [5]; default: 0;
 * When configured as an I2C Slave, and the address sent by the master is
 * equal to the address of the slave, then this bit will be of high level.
 */

#define I2C_SLAVE_ADDRESSED    (BIT(5))
#define I2C_SLAVE_ADDRESSED_M  (I2C_SLAVE_ADDRESSED_V << I2C_SLAVE_ADDRESSED_S)
#define I2C_SLAVE_ADDRESSED_V  0x00000001
#define I2C_SLAVE_ADDRESSED_S  5

/* I2C_BUS_BUSY : RO; bitpos: [4]; default: 0;
 * 1: the I2C bus is busy transferring data. 0: the I2C bus is in idle state.
 */

#define I2C_BUS_BUSY    (BIT(4))
#define I2C_BUS_BUSY_M  (I2C_BUS_BUSY_V << I2C_BUS_BUSY_S)
#define I2C_BUS_BUSY_V  0x00000001
#define I2C_BUS_BUSY_S  4

/* I2C_ARB_LOST : RO; bitpos: [3]; default: 0;
 * When the I2C controller loses control of SCL line, this register changes
 * to 1.
 */

#define I2C_ARB_LOST    (BIT(3))
#define I2C_ARB_LOST_M  (I2C_ARB_LOST_V << I2C_ARB_LOST_S)
#define I2C_ARB_LOST_V  0x00000001
#define I2C_ARB_LOST_S  3

/* I2C_TIME_OUT : RO; bitpos: [2]; default: 0;
 * When the I2C controller takes more than I2C_TIME_OUT clocks to receive a
 * data bit, this field changes to 1.
 */

#define I2C_TIME_OUT    (BIT(2))
#define I2C_TIME_OUT_M  (I2C_TIME_OUT_V << I2C_TIME_OUT_S)
#define I2C_TIME_OUT_V  0x00000001
#define I2C_TIME_OUT_S  2

/* I2C_SLAVE_RW : RO; bitpos: [1]; default: 0;
 * When in slave mode, 1: master reads from slave. 0: master writes to slave.
 */

#define I2C_SLAVE_RW    (BIT(1))
#define I2C_SLAVE_RW_M  (I2C_SLAVE_RW_V << I2C_SLAVE_RW_S)
#define I2C_SLAVE_RW_V  0x00000001
#define I2C_SLAVE_RW_S  1

/* I2C_RESP_REC : RO; bitpos: [0]; default: 0;
 * The received ACK value in master mode or slave mode. 0: ACK. 1: NACK.
 */

#define I2C_RESP_REC    (BIT(0))
#define I2C_RESP_REC_M  (I2C_RESP_REC_V << I2C_RESP_REC_S)
#define I2C_RESP_REC_V  0x00000001
#define I2C_RESP_REC_S  0

/* I2C_TO_REG register
 * Setting time out control for receiving data
 */

#define I2C_TO_REG(i) (REG_I2C_BASE(i) + 0xc)

/* I2C_TIME_OUT_EN : R/W; bitpos: [24]; default: 0;
 * This is the enable bit for time out control.
 */

#define I2C_TIME_OUT_EN    (BIT(24))
#define I2C_TIME_OUT_EN_M  (I2C_TIME_OUT_EN_V << I2C_TIME_OUT_EN_S)
#define I2C_TIME_OUT_EN_V  0x00000001
#define I2C_TIME_OUT_EN_S  24

/* I2C_TIME_OUT_VALUE : R/W; bitpos: [23:0]; default: 0;
 * This register is used to configure the timeout for receiving a data bit
 * in APB clock cycles.
 */

#define I2C_TIME_OUT_VALUE    0x00ffffff
#define I2C_TIME_OUT_VALUE_M  (I2C_TIME_OUT_VALUE_V << I2C_TIME_OUT_VALUE_S)
#define I2C_TIME_OUT_VALUE_V  0x00ffffff
#define I2C_TIME_OUT_VALUE_S  0

/* I2C_SLAVE_ADDR_REG register
 * Local slave address setting
 */

#define I2C_SLAVE_ADDR_REG(i) (REG_I2C_BASE(i) + 0x10)

/* I2C_ADDR_10BIT_EN : R/W; bitpos: [31]; default: 0;
 * This field is used to enable the slave 10-bit addressing mode in master
 * mode.
 */

#define I2C_ADDR_10BIT_EN    (BIT(31))
#define I2C_ADDR_10BIT_EN_M  (I2C_ADDR_10BIT_EN_V << I2C_ADDR_10BIT_EN_S)
#define I2C_ADDR_10BIT_EN_V  0x00000001
#define I2C_ADDR_10BIT_EN_S  31

/* I2C_SLAVE_ADDR : R/W; bitpos: [14:0]; default: 0;
 * When configured as an I2C Slave, this field is used to configure the
 * slave address.
 */

#define I2C_SLAVE_ADDR    0x00007fff
#define I2C_SLAVE_ADDR_M  (I2C_SLAVE_ADDR_V << I2C_SLAVE_ADDR_S)
#define I2C_SLAVE_ADDR_V  0x00007fff
#define I2C_SLAVE_ADDR_S  0

/* I2C_FIFO_ST_REG register
 * FIFO status register
 */

#define I2C_FIFO_ST_REG(i) (REG_I2C_BASE(i) + 0x14)

/* I2C_SLAVE_RW_POINT : RO; bitpos: [29:22]; default: 0;
 * The received data in I2C slave mode.
 */

#define I2C_SLAVE_RW_POINT    0x000000ff
#define I2C_SLAVE_RW_POINT_M  (I2C_SLAVE_RW_POINT_V << I2C_SLAVE_RW_POINT_S)
#define I2C_SLAVE_RW_POINT_V  0x000000ff
#define I2C_SLAVE_RW_POINT_S  22

/* I2C_TX_UPDATE : WO; bitpos: [21]; default: 0;
 * Write 0 or 1 to I2C_TX_UPDATE to update the value of I2C_TXFIFO_END_ADDR
 * and I2C_TXFIFO_START_ADDR.
 */

#define I2C_TX_UPDATE    (BIT(21))
#define I2C_TX_UPDATE_M  (I2C_TX_UPDATE_V << I2C_TX_UPDATE_S)
#define I2C_TX_UPDATE_V  0x00000001
#define I2C_TX_UPDATE_S  21

/* I2C_RX_UPDATE : WO; bitpos: [20]; default: 0;
 * Write 0 or 1 to I2C_RX_UPDATE to update the value of I2C_RXFIFO_END_ADDR
 * and I2C_RXFIFO_START_ADDR.
 */

#define I2C_RX_UPDATE    (BIT(20))
#define I2C_RX_UPDATE_M  (I2C_RX_UPDATE_V << I2C_RX_UPDATE_S)
#define I2C_RX_UPDATE_V  0x00000001
#define I2C_RX_UPDATE_S  20

/* I2C_TXFIFO_END_ADDR : RO; bitpos: [19:15]; default: 0;
 * This is the offset address of the last sent data, as described in
 * I2C_NONFIFO_TX_THRES.
 *
 * The value refreshes when an I2C_TXFIFO_OVF_INT or I2C_TRANS_COMPLETE_INT
 * interrupt is generated.
 */

#define I2C_TXFIFO_END_ADDR    0x0000001f
#define I2C_TXFIFO_END_ADDR_M  (I2C_TXFIFO_END_ADDR_V << I2C_TXFIFO_END_ADDR_S)
#define I2C_TXFIFO_END_ADDR_V  0x0000001f
#define I2C_TXFIFO_END_ADDR_S  15

/* I2C_TXFIFO_START_ADDR : RO; bitpos: [14:10]; default: 0;
 * This is the offset address of the first sent data, as described in
 * I2C_NONFIFO_TX_THRES.
 */

#define I2C_TXFIFO_START_ADDR    0x0000001f
#define I2C_TXFIFO_START_ADDR_M  (I2C_TXFIFO_START_ADDR_V << I2C_TXFIFO_START_ADDR_S)
#define I2C_TXFIFO_START_ADDR_V  0x0000001f
#define I2C_TXFIFO_START_ADDR_S  10

/* I2C_RXFIFO_END_ADDR : RO; bitpos: [9:5]; default: 0;
 * This is the offset address of the last received data, as described in
 * I2C_NONFIFO_RX_THRES. This value refreshes when an I2C_RXFIFO_UDF_INT or
 * I2C_TRANS_COMPLETE_INT interrupt is generated.
 */

