apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
#define I2C_RXFIFO_END_ADDR    0x0000001f
#define I2C_RXFIFO_END_ADDR_M  (I2C_RXFIFO_END_ADDR_V << I2C_RXFIFO_END_ADDR_S)
#define I2C_RXFIFO_END_ADDR_V  0x0000001f
#define I2C_RXFIFO_END_ADDR_S  5

/* I2C_RXFIFO_START_ADDR : RO; bitpos: [4:0]; default: 0;
 * This is the offset address of the last received data, as described in
 * I2C_NONFIFO_RX_THRES.
 */

#define I2C_RXFIFO_START_ADDR    0x0000001f
#define I2C_RXFIFO_START_ADDR_M  (I2C_RXFIFO_START_ADDR_V << I2C_RXFIFO_START_ADDR_S)
#define I2C_RXFIFO_START_ADDR_V  0x0000001f
#define I2C_RXFIFO_START_ADDR_S  0

/* I2C_FIFO_CONF_REG register
 * FIFO configuration register
 */

#define I2C_FIFO_CONF_REG(i) (REG_I2C_BASE(i) + 0x18)

/* I2C_FIFO_PRT_EN : R/W; bitpos: [26]; default: 1;
 * The control enable bit of FIFO pointer in non-FIFO mode. This bit
 * controls the valid bits and the interrupts of TX/RX FIFO overflow,
 * underflow, full and empty.
 */

#define I2C_FIFO_PRT_EN    (BIT(26))
#define I2C_FIFO_PRT_EN_M  (I2C_FIFO_PRT_EN_V << I2C_FIFO_PRT_EN_S)
#define I2C_FIFO_PRT_EN_V  0x00000001
#define I2C_FIFO_PRT_EN_S  26

/* I2C_NONFIFO_TX_THRES : R/W; bitpos: [25:20]; default: 21;
 * When I2C sends more than I2C_NONFIFO_TX_THRES bytes of data, it will
 * generate an I2C_TXFIFO_OVF_INT interrupt and update the current offset
 * address of the sent data.
 */

#define I2C_NONFIFO_TX_THRES    0x0000003f
#define I2C_NONFIFO_TX_THRES_M  (I2C_NONFIFO_TX_THRES_V << I2C_NONFIFO_TX_THRES_S)
#define I2C_NONFIFO_TX_THRES_V  0x0000003f
#define I2C_NONFIFO_TX_THRES_S  20

/* I2C_NONFIFO_RX_THRES : R/W; bitpos: [19:14]; default: 21;
 * When I2C receives more than I2C_NONFIFO_RX_THRES bytes of data, it will
 * generate an I2C_RXFIFO_UDF_INT interrupt and update the current offset
 * address of the received data.
 */

#define I2C_NONFIFO_RX_THRES    0x0000003f
#define I2C_NONFIFO_RX_THRES_M  (I2C_NONFIFO_RX_THRES_V << I2C_NONFIFO_RX_THRES_S)
#define I2C_NONFIFO_RX_THRES_V  0x0000003f
#define I2C_NONFIFO_RX_THRES_S  14

/* I2C_TX_FIFO_RST : R/W; bitpos: [13]; default: 0;
 * Set this bit to reset TX FIFO.
 */

#define I2C_TX_FIFO_RST    (BIT(13))
#define I2C_TX_FIFO_RST_M  (I2C_TX_FIFO_RST_V << I2C_TX_FIFO_RST_S)
#define I2C_TX_FIFO_RST_V  0x00000001
#define I2C_TX_FIFO_RST_S  13

/* I2C_RX_FIFO_RST : R/W; bitpos: [12]; default: 0;
 * Set this bit to reset RX FIFO.
 */

#define I2C_RX_FIFO_RST    (BIT(12))
#define I2C_RX_FIFO_RST_M  (I2C_RX_FIFO_RST_V << I2C_RX_FIFO_RST_S)
#define I2C_RX_FIFO_RST_V  0x00000001
#define I2C_RX_FIFO_RST_S  12

/* I2C_FIFO_ADDR_CFG_EN : R/W; bitpos: [11]; default: 0;
 * When this bit is set to 1, the byte received after the I2C address byte
 * represents the offset address in the I2C Slave RAM.
 */

#define I2C_FIFO_ADDR_CFG_EN    (BIT(11))
#define I2C_FIFO_ADDR_CFG_EN_M  (I2C_FIFO_ADDR_CFG_EN_V << I2C_FIFO_ADDR_CFG_EN_S)
#define I2C_FIFO_ADDR_CFG_EN_V  0x00000001
#define I2C_FIFO_ADDR_CFG_EN_S  11

/* I2C_NONFIFO_EN : R/W; bitpos: [10]; default: 0;
 * Set this bit to enable APB non-FIFO mode.
 */

#define I2C_NONFIFO_EN    (BIT(10))
#define I2C_NONFIFO_EN_M  (I2C_NONFIFO_EN_V << I2C_NONFIFO_EN_S)
#define I2C_NONFIFO_EN_V  0x00000001
#define I2C_NONFIFO_EN_S  10

/* I2C_TXFIFO_WM_THRHD : R/W; bitpos: [9:5]; default: 4;
 * The water mark threshold of TX FIFO in non-FIFO mode. When
 * I2C_FIFO_PRT_EN is 1 and TX FIFO counter is smaller than
 * I2C_TXFIFO_WM_THRHD[4:0], I2C_TXFIFO_WM_INT_RAW bit will be valid.
 */

#define I2C_TXFIFO_WM_THRHD    0x0000001f
#define I2C_TXFIFO_WM_THRHD_M  (I2C_TXFIFO_WM_THRHD_V << I2C_TXFIFO_WM_THRHD_S)
#define I2C_TXFIFO_WM_THRHD_V  0x0000001f
#define I2C_TXFIFO_WM_THRHD_S  5

/* I2C_RXFIFO_WM_THRHD : R/W; bitpos: [4:0]; default: 11;
 * The water mark threshold of RX FIFO in non-FIFO mode. When
 * I2C_FIFO_PRT_EN is 1 and RX FIFO counter is bigger than
 * I2C_RXFIFO_WM_THRHD[4:0], I2C_RXFIFO_WM_INT_RAW bit will be valid.
 */

#define I2C_RXFIFO_WM_THRHD    0x0000001f
#define I2C_RXFIFO_WM_THRHD_M  (I2C_RXFIFO_WM_THRHD_V << I2C_RXFIFO_WM_THRHD_S)
#define I2C_RXFIFO_WM_THRHD_V  0x0000001f
#define I2C_RXFIFO_WM_THRHD_S  0

/* I2C_DATA_REG register
 * RX FIFO read data
 */

#define I2C_DATA_REG(i) (REG_I2C_BASE(i) + 0x1c)

/* I2C_FIFO_RDATA : RO; bitpos: [7:0]; default: 0;
 * The value of RX FIFO read data.
 */

#define I2C_FIFO_RDATA    0x000000ff
#define I2C_FIFO_RDATA_M  (I2C_FIFO_RDATA_V << I2C_FIFO_RDATA_S)
#define I2C_FIFO_RDATA_V  0x000000ff
#define I2C_FIFO_RDATA_S  0

/* I2C_INT_RAW_REG register
 * Raw interrupt status
 */

#define I2C_INT_RAW_REG(i) (REG_I2C_BASE(i) + 0x20)

/* I2C_SLAVE_STRETCH_INT_RAW : RO; bitpos: [16]; default: 0;
 * The raw interrupt bit for I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_SLAVE_STRETCH_INT_RAW    (BIT(16))
#define I2C_SLAVE_STRETCH_INT_RAW_M  (I2C_SLAVE_STRETCH_INT_RAW_V << I2C_SLAVE_STRETCH_INT_RAW_S)
#define I2C_SLAVE_STRETCH_INT_RAW_V  0x00000001
#define I2C_SLAVE_STRETCH_INT_RAW_S  16

/* I2C_DET_START_INT_RAW : RO; bitpos: [15]; default: 0;
 * The raw interrupt bit for I2C_DET_START_INT interrupt.
 */

#define I2C_DET_START_INT_RAW    (BIT(15))
#define I2C_DET_START_INT_RAW_M  (I2C_DET_START_INT_RAW_V << I2C_DET_START_INT_RAW_S)
#define I2C_DET_START_INT_RAW_V  0x00000001
#define I2C_DET_START_INT_RAW_S  15

/* I2C_SCL_MAIN_ST_TO_INT_RAW : RO; bitpos: [14]; default: 0;
 * The raw interrupt bit for I2C_SCL_MAIN_ST_TO_INT interrupt.
 */

#define I2C_SCL_MAIN_ST_TO_INT_RAW    (BIT(14))
#define I2C_SCL_MAIN_ST_TO_INT_RAW_M  (I2C_SCL_MAIN_ST_TO_INT_RAW_V << I2C_SCL_MAIN_ST_TO_INT_RAW_S)
#define I2C_SCL_MAIN_ST_TO_INT_RAW_V  0x00000001
#define I2C_SCL_MAIN_ST_TO_INT_RAW_S  14

/* I2C_SCL_ST_TO_INT_RAW : RO; bitpos: [13]; default: 0;
 * The raw interrupt bit for I2C_SCL_ST_TO_INT interrupt.
 */

#define I2C_SCL_ST_TO_INT_RAW    (BIT(13))
#define I2C_SCL_ST_TO_INT_RAW_M  (I2C_SCL_ST_TO_INT_RAW_V << I2C_SCL_ST_TO_INT_RAW_S)
#define I2C_SCL_ST_TO_INT_RAW_V  0x00000001
#define I2C_SCL_ST_TO_INT_RAW_S  13

/* I2C_RXFIFO_UDF_INT_RAW : RO; bitpos: [12]; default: 0;
 * The raw interrupt bit for I2C_RXFIFO_UDF_INT  interrupt.
 */

#define I2C_RXFIFO_UDF_INT_RAW    (BIT(12))
#define I2C_RXFIFO_UDF_INT_RAW_M  (I2C_RXFIFO_UDF_INT_RAW_V << I2C_RXFIFO_UDF_INT_RAW_S)
#define I2C_RXFIFO_UDF_INT_RAW_V  0x00000001
#define I2C_RXFIFO_UDF_INT_RAW_S  12

/* I2C_TXFIFO_OVF_INT_RAW : RO; bitpos: [11]; default: 0;
 * The raw interrupt bit for I2C_TXFIFO_OVF_INT interrupt.
 */

#define I2C_TXFIFO_OVF_INT_RAW    (BIT(11))
#define I2C_TXFIFO_OVF_INT_RAW_M  (I2C_TXFIFO_OVF_INT_RAW_V << I2C_TXFIFO_OVF_INT_RAW_S)
#define I2C_TXFIFO_OVF_INT_RAW_V  0x00000001
#define I2C_TXFIFO_OVF_INT_RAW_S  11

