apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
/* I2C_TRANS_COMPLETE_INT_ENA : R/W; bitpos: [7]; default: 0;
 * The raw interrupt bit for the I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_TRANS_COMPLETE_INT_ENA    (BIT(7))
#define I2C_TRANS_COMPLETE_INT_ENA_M  (I2C_TRANS_COMPLETE_INT_ENA_V << I2C_TRANS_COMPLETE_INT_ENA_S)
#define I2C_TRANS_COMPLETE_INT_ENA_V  0x00000001
#define I2C_TRANS_COMPLETE_INT_ENA_S  7

/* I2C_MST_TXFIFO_UDF_INT_ENA : R/W; bitpos: [6]; default: 0;
 * The raw interrupt bit for I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_MST_TXFIFO_UDF_INT_ENA    (BIT(6))
#define I2C_MST_TXFIFO_UDF_INT_ENA_M  (I2C_MST_TXFIFO_UDF_INT_ENA_V << I2C_MST_TXFIFO_UDF_INT_ENA_S)
#define I2C_MST_TXFIFO_UDF_INT_ENA_V  0x00000001
#define I2C_MST_TXFIFO_UDF_INT_ENA_S  6

/* I2C_ARBITRATION_LOST_INT_ENA : R/W; bitpos: [5]; default: 0;
 * The raw interrupt bit for the I2C_ARBITRATION_LOST_INT interrupt.
 */

#define I2C_ARBITRATION_LOST_INT_ENA    (BIT(5))
#define I2C_ARBITRATION_LOST_INT_ENA_M  (I2C_ARBITRATION_LOST_INT_ENA_V << I2C_ARBITRATION_LOST_INT_ENA_S)
#define I2C_ARBITRATION_LOST_INT_ENA_V  0x00000001
#define I2C_ARBITRATION_LOST_INT_ENA_S  5

/* I2C_BYTE_TRANS_DONE_INT_ENA : R/W; bitpos: [4]; default: 0;
 * The raw interrupt bit for the I2C_END_DETECT_INT interrupt.
 */

#define I2C_BYTE_TRANS_DONE_INT_ENA    (BIT(4))
#define I2C_BYTE_TRANS_DONE_INT_ENA_M  (I2C_BYTE_TRANS_DONE_INT_ENA_V << I2C_BYTE_TRANS_DONE_INT_ENA_S)
#define I2C_BYTE_TRANS_DONE_INT_ENA_V  0x00000001
#define I2C_BYTE_TRANS_DONE_INT_ENA_S  4

/* I2C_END_DETECT_INT_ENA : R/W; bitpos: [3]; default: 0;
 * The raw interrupt bit for the I2C_END_DETECT_INT interrupt.
 */

#define I2C_END_DETECT_INT_ENA    (BIT(3))
#define I2C_END_DETECT_INT_ENA_M  (I2C_END_DETECT_INT_ENA_V << I2C_END_DETECT_INT_ENA_S)
#define I2C_END_DETECT_INT_ENA_V  0x00000001
#define I2C_END_DETECT_INT_ENA_S  3

/* I2C_RXFIFO_OVF_INT_ENA : R/W; bitpos: [2]; default: 0;
 * The raw interrupt bit for I2C_RXFIFO_OVF_INT interrupt.
 */

#define I2C_RXFIFO_OVF_INT_ENA    (BIT(2))
#define I2C_RXFIFO_OVF_INT_ENA_M  (I2C_RXFIFO_OVF_INT_ENA_V << I2C_RXFIFO_OVF_INT_ENA_S)
#define I2C_RXFIFO_OVF_INT_ENA_V  0x00000001
#define I2C_RXFIFO_OVF_INT_ENA_S  2

/* I2C_TXFIFO_WM_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The raw interrupt bit for I2C_TXFIFO_WM_INT interrupt.
 */

#define I2C_TXFIFO_WM_INT_ENA    (BIT(1))
#define I2C_TXFIFO_WM_INT_ENA_M  (I2C_TXFIFO_WM_INT_ENA_V << I2C_TXFIFO_WM_INT_ENA_S)
#define I2C_TXFIFO_WM_INT_ENA_V  0x00000001
#define I2C_TXFIFO_WM_INT_ENA_S  1

/* I2C_RXFIFO_WM_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The raw interrupt bit for I2C_RXFIFO_WM_INT interrupt.
 */

#define I2C_RXFIFO_WM_INT_ENA    (BIT(0))
#define I2C_RXFIFO_WM_INT_ENA_M  (I2C_RXFIFO_WM_INT_ENA_V << I2C_RXFIFO_WM_INT_ENA_S)
#define I2C_RXFIFO_WM_INT_ENA_V  0x00000001
#define I2C_RXFIFO_WM_INT_ENA_S  0

/* I2C_INT_STATUS_REG register
 * Status of captured I2C communication events
 */

#define I2C_INT_STATUS_REG(i) (REG_I2C_BASE(i) + 0x2c)

/* I2C_SLAVE_STRETCH_INT_ST : RO; bitpos: [16]; default: 0;
 * The masked interrupt status bit for I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_SLAVE_STRETCH_INT_ST    (BIT(16))
#define I2C_SLAVE_STRETCH_INT_ST_M  (I2C_SLAVE_STRETCH_INT_ST_V << I2C_SLAVE_STRETCH_INT_ST_S)
#define I2C_SLAVE_STRETCH_INT_ST_V  0x00000001
#define I2C_SLAVE_STRETCH_INT_ST_S  16

/* I2C_DET_START_INT_ST : RO; bitpos: [15]; default: 0;
 * The masked interrupt status bit for I2C_DET_START_INT interrupt.
 */

#define I2C_DET_START_INT_ST    (BIT(15))
#define I2C_DET_START_INT_ST_M  (I2C_DET_START_INT_ST_V << I2C_DET_START_INT_ST_S)
#define I2C_DET_START_INT_ST_V  0x00000001
#define I2C_DET_START_INT_ST_S  15

/* I2C_SCL_MAIN_ST_TO_INT_ST : RO; bitpos: [14]; default: 0;
 * The masked interrupt status bit for I2C_SCL_MAIN_ST_TO_INT interrupt.
 */

#define I2C_SCL_MAIN_ST_TO_INT_ST    (BIT(14))
#define I2C_SCL_MAIN_ST_TO_INT_ST_M  (I2C_SCL_MAIN_ST_TO_INT_ST_V << I2C_SCL_MAIN_ST_TO_INT_ST_S)
#define I2C_SCL_MAIN_ST_TO_INT_ST_V  0x00000001
#define I2C_SCL_MAIN_ST_TO_INT_ST_S  14

/* I2C_SCL_ST_TO_INT_ST : RO; bitpos: [13]; default: 0;
 * The masked interrupt status bit for I2C_SCL_ST_TO_INT interrupt.
 */

#define I2C_SCL_ST_TO_INT_ST    (BIT(13))
#define I2C_SCL_ST_TO_INT_ST_M  (I2C_SCL_ST_TO_INT_ST_V << I2C_SCL_ST_TO_INT_ST_S)
#define I2C_SCL_ST_TO_INT_ST_V  0x00000001
#define I2C_SCL_ST_TO_INT_ST_S  13

/* I2C_RXFIFO_UDF_INT_ST : RO; bitpos: [12]; default: 0;
 * The masked interrupt status bit for I2C_RXFIFO_UDF_INT  interrupt.
 */

#define I2C_RXFIFO_UDF_INT_ST    (BIT(12))
#define I2C_RXFIFO_UDF_INT_ST_M  (I2C_RXFIFO_UDF_INT_ST_V << I2C_RXFIFO_UDF_INT_ST_S)
#define I2C_RXFIFO_UDF_INT_ST_V  0x00000001
#define I2C_RXFIFO_UDF_INT_ST_S  12

/* I2C_TXFIFO_OVF_INT_ST : RO; bitpos: [11]; default: 0;
 * The masked interrupt status bit for I2C_TXFIFO_OVF_INT interrupt.
 */

#define I2C_TXFIFO_OVF_INT_ST    (BIT(11))
#define I2C_TXFIFO_OVF_INT_ST_M  (I2C_TXFIFO_OVF_INT_ST_V << I2C_TXFIFO_OVF_INT_ST_S)
#define I2C_TXFIFO_OVF_INT_ST_V  0x00000001
#define I2C_TXFIFO_OVF_INT_ST_S  11

/* I2C_NACK_INT_ST : RO; bitpos: [10]; default: 0;
 * The masked interrupt status bit for I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_NACK_INT_ST    (BIT(10))
#define I2C_NACK_INT_ST_M  (I2C_NACK_INT_ST_V << I2C_NACK_INT_ST_S)
#define I2C_NACK_INT_ST_V  0x00000001
#define I2C_NACK_INT_ST_S  10

/* I2C_TRANS_START_INT_ST : RO; bitpos: [9]; default: 0;
 * The masked interrupt status bit for the I2C_TRANS_START_INT interrupt.
 */

#define I2C_TRANS_START_INT_ST    (BIT(9))
#define I2C_TRANS_START_INT_ST_M  (I2C_TRANS_START_INT_ST_V << I2C_TRANS_START_INT_ST_S)
#define I2C_TRANS_START_INT_ST_V  0x00000001
#define I2C_TRANS_START_INT_ST_S  9

/* I2C_TIME_OUT_INT_ST : RO; bitpos: [8]; default: 0;
 * The masked interrupt status bit for the I2C_TIME_OUT_INT interrupt.
 */

#define I2C_TIME_OUT_INT_ST    (BIT(8))
#define I2C_TIME_OUT_INT_ST_M  (I2C_TIME_OUT_INT_ST_V << I2C_TIME_OUT_INT_ST_S)
#define I2C_TIME_OUT_INT_ST_V  0x00000001
#define I2C_TIME_OUT_INT_ST_S  8

/* I2C_TRANS_COMPLETE_INT_ST : RO; bitpos: [7]; default: 0;
 * The masked interrupt status bit for the I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_TRANS_COMPLETE_INT_ST    (BIT(7))
#define I2C_TRANS_COMPLETE_INT_ST_M  (I2C_TRANS_COMPLETE_INT_ST_V << I2C_TRANS_COMPLETE_INT_ST_S)
#define I2C_TRANS_COMPLETE_INT_ST_V  0x00000001
#define I2C_TRANS_COMPLETE_INT_ST_S  7

/* I2C_MST_TXFIFO_UDF_INT_ST : RO; bitpos: [6]; default: 0;
 * The masked interrupt status bit for I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_MST_TXFIFO_UDF_INT_ST    (BIT(6))
#define I2C_MST_TXFIFO_UDF_INT_ST_M  (I2C_MST_TXFIFO_UDF_INT_ST_V << I2C_MST_TXFIFO_UDF_INT_ST_S)
#define I2C_MST_TXFIFO_UDF_INT_ST_V  0x00000001
#define I2C_MST_TXFIFO_UDF_INT_ST_S  6

/* I2C_ARBITRATION_LOST_INT_ST : RO; bitpos: [5]; default: 0;
 * The masked interrupt status bit for the I2C_ARBITRATION_LOST_INT
 * interrupt.
 */

#define I2C_ARBITRATION_LOST_INT_ST    (BIT(5))
#define I2C_ARBITRATION_LOST_INT_ST_M  (I2C_ARBITRATION_LOST_INT_ST_V << I2C_ARBITRATION_LOST_INT_ST_S)
#define I2C_ARBITRATION_LOST_INT_ST_V  0x00000001
#define I2C_ARBITRATION_LOST_INT_ST_S  5

/* I2C_BYTE_TRANS_DONE_INT_ST : RO; bitpos: [4]; default: 0;
 * The masked interrupt status bit for the I2C_END_DETECT_INT interrupt.
 */

#define I2C_BYTE_TRANS_DONE_INT_ST    (BIT(4))
#define I2C_BYTE_TRANS_DONE_INT_ST_M  (I2C_BYTE_TRANS_DONE_INT_ST_V << I2C_BYTE_TRANS_DONE_INT_ST_S)
#define I2C_BYTE_TRANS_DONE_INT_ST_V  0x00000001
#define I2C_BYTE_TRANS_DONE_INT_ST_S  4

