apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
/* I2C_END_DETECT_INT_ST : RO; bitpos: [3]; default: 0;
 * The masked interrupt status bit for the I2C_END_DETECT_INT interrupt.
 */

#define I2C_END_DETECT_INT_ST    (BIT(3))
#define I2C_END_DETECT_INT_ST_M  (I2C_END_DETECT_INT_ST_V << I2C_END_DETECT_INT_ST_S)
#define I2C_END_DETECT_INT_ST_V  0x00000001
#define I2C_END_DETECT_INT_ST_S  3

/* I2C_RXFIFO_OVF_INT_ST : RO; bitpos: [2]; default: 0;
 * The masked interrupt status bit for I2C_RXFIFO_OVF_INT interrupt.
 */

#define I2C_RXFIFO_OVF_INT_ST    (BIT(2))
#define I2C_RXFIFO_OVF_INT_ST_M  (I2C_RXFIFO_OVF_INT_ST_V << I2C_RXFIFO_OVF_INT_ST_S)
#define I2C_RXFIFO_OVF_INT_ST_V  0x00000001
#define I2C_RXFIFO_OVF_INT_ST_S  2

/* I2C_TXFIFO_WM_INT_ST : RO; bitpos: [1]; default: 0;
 * The masked interrupt status bit for I2C_TXFIFO_WM_INT interrupt.
 */

#define I2C_TXFIFO_WM_INT_ST    (BIT(1))
#define I2C_TXFIFO_WM_INT_ST_M  (I2C_TXFIFO_WM_INT_ST_V << I2C_TXFIFO_WM_INT_ST_S)
#define I2C_TXFIFO_WM_INT_ST_V  0x00000001
#define I2C_TXFIFO_WM_INT_ST_S  1

/* I2C_RXFIFO_WM_INT_ST : RO; bitpos: [0]; default: 0;
 * The masked interrupt status bit for I2C_RXFIFO_WM_INT interrupt.
 */

#define I2C_RXFIFO_WM_INT_ST    (BIT(0))
#define I2C_RXFIFO_WM_INT_ST_M  (I2C_RXFIFO_WM_INT_ST_V << I2C_RXFIFO_WM_INT_ST_S)
#define I2C_RXFIFO_WM_INT_ST_V  0x00000001
#define I2C_RXFIFO_WM_INT_ST_S  0

/* I2C_SDA_HOLD_REG register
 * Configures the hold time after a negative SCL edge
 */

#define I2C_SDA_HOLD_REG(i) (REG_I2C_BASE(i) + 0x30)

/* I2C_SDA_HOLD_TIME : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the interval between changing the SDA
 * output level and the falling edge of SCL, in I2C module clock cycles.
 */

#define I2C_SDA_HOLD_TIME    0x000003ff
#define I2C_SDA_HOLD_TIME_M  (I2C_SDA_HOLD_TIME_V << I2C_SDA_HOLD_TIME_S)
#define I2C_SDA_HOLD_TIME_V  0x000003ff
#define I2C_SDA_HOLD_TIME_S  0

/* I2C_SDA_SAMPLE_REG register
 * Configures the sample time after a positive SCL edge
 */

#define I2C_SDA_SAMPLE_REG(i) (REG_I2C_BASE(i) + 0x34)

/* I2C_SDA_SAMPLE_TIME : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the interval between the rising edge
 * of SCL and the level sampling time of SDA, in I2C module clock cycles.
 */

#define I2C_SDA_SAMPLE_TIME    0x000003ff
#define I2C_SDA_SAMPLE_TIME_M  (I2C_SDA_SAMPLE_TIME_V << I2C_SDA_SAMPLE_TIME_S)
#define I2C_SDA_SAMPLE_TIME_V  0x000003ff
#define I2C_SDA_SAMPLE_TIME_S  0

/* I2C_SCL_HIGH_PERIOD_REG register
 * Configures the high level width of the SCL clock
 */

#define I2C_SCL_HIGH_PERIOD_REG(i) (REG_I2C_BASE(i) + 0x38)

/* I2C_SCL_WAIT_HIGH_PERIOD : R/W; bitpos: [27:14]; default: 0;
 * This register is used to configure for the SCL_FSM's waiting period for
 * SCL to go high in master mode, in I2C module clock cycles.
 */

#define I2C_SCL_WAIT_HIGH_PERIOD    0x00003fff
#define I2C_SCL_WAIT_HIGH_PERIOD_M  (I2C_SCL_WAIT_HIGH_PERIOD_V << I2C_SCL_WAIT_HIGH_PERIOD_S)
#define I2C_SCL_WAIT_HIGH_PERIOD_V  0x00003fff
#define I2C_SCL_WAIT_HIGH_PERIOD_S  14

/* I2C_SCL_HIGH_PERIOD : R/W; bitpos: [13:0]; default: 0;
 * This register is used to configure for how long SCL remains high in
 * master mode, in I2C module clock cycles.
 */

#define I2C_SCL_HIGH_PERIOD    0x00003fff
#define I2C_SCL_HIGH_PERIOD_M  (I2C_SCL_HIGH_PERIOD_V << I2C_SCL_HIGH_PERIOD_S)
#define I2C_SCL_HIGH_PERIOD_V  0x00003fff
#define I2C_SCL_HIGH_PERIOD_S  0

/* I2C_SCL_START_HOLD_REG register
 * Configures the interval between pulling SDA low and pulling SCL low when
 * the master generates a START condition
 */

#define I2C_SCL_START_HOLD_REG(i) (REG_I2C_BASE(i) + 0x40)

/* I2C_SCL_START_HOLD_TIME : R/W; bitpos: [9:0]; default: 8;
 * This register is used to configure  interval between pulling SDA low and
 * pulling SCL low when the master generates a START condition, in I2C
 * module clock cycles.
 */

#define I2C_SCL_START_HOLD_TIME    0x000003ff
#define I2C_SCL_START_HOLD_TIME_M  (I2C_SCL_START_HOLD_TIME_V << I2C_SCL_START_HOLD_TIME_S)
#define I2C_SCL_START_HOLD_TIME_V  0x000003ff
#define I2C_SCL_START_HOLD_TIME_S  0

/* I2C_SCL_RSTART_SETUP_REG register
 * Configures the interval between the positive edge of SCL and the negative
 * edge of SDA
 */

#define I2C_SCL_RSTART_SETUP_REG(i) (REG_I2C_BASE(i) + 0x44)

/* I2C_SCL_RSTART_SETUP_TIME : R/W; bitpos: [9:0]; default: 8;
 * This register is used to configure the interval between the positive edge
 * of SCL and the negative edge of SDA for a RESTART condition, in I2C
 * module clock cycles.
 */

#define I2C_SCL_RSTART_SETUP_TIME    0x000003ff
#define I2C_SCL_RSTART_SETUP_TIME_M  (I2C_SCL_RSTART_SETUP_TIME_V << I2C_SCL_RSTART_SETUP_TIME_S)
#define I2C_SCL_RSTART_SETUP_TIME_V  0x000003ff
#define I2C_SCL_RSTART_SETUP_TIME_S  0

/* I2C_SCL_STOP_HOLD_REG register
 * Configures the delay after the SCL clock edge for a stop condition
 */

#define I2C_SCL_STOP_HOLD_REG(i) (REG_I2C_BASE(i) + 0x48)

/* I2C_SCL_STOP_HOLD_TIME : R/W; bitpos: [13:0]; default: 0;
 * This register is used to configure the delay after the STOP condition, in
 * I2C module clock cycles.
 */

#define I2C_SCL_STOP_HOLD_TIME    0x00003fff
#define I2C_SCL_STOP_HOLD_TIME_M  (I2C_SCL_STOP_HOLD_TIME_V << I2C_SCL_STOP_HOLD_TIME_S)
#define I2C_SCL_STOP_HOLD_TIME_V  0x00003fff
#define I2C_SCL_STOP_HOLD_TIME_S  0

/* I2C_SCL_STOP_SETUP_REG register
 * Configures the delay between the SDA and SCL positive edge for a stop
 * condition
 */

#define I2C_SCL_STOP_SETUP_REG(i) (REG_I2C_BASE(i) + 0x4c)

/* I2C_SCL_STOP_SETUP_TIME : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the time between the positive edge of
 * SCL and the positive edge of SDA, in I2C module clock cycles.
 */

#define I2C_SCL_STOP_SETUP_TIME    0x000003ff
#define I2C_SCL_STOP_SETUP_TIME_M  (I2C_SCL_STOP_SETUP_TIME_V << I2C_SCL_STOP_SETUP_TIME_S)
#define I2C_SCL_STOP_SETUP_TIME_V  0x000003ff
#define I2C_SCL_STOP_SETUP_TIME_S  0

/* I2C_SCL_FILTER_CFG_REG register
 * SCL filter configuration register
 */

#define I2C_SCL_FILTER_CFG_REG(i) (REG_I2C_BASE(i) + 0x50)

/* I2C_SCL_FILTER_EN : R/W; bitpos: [4]; default: 1;
 * This is the filter enable bit for SCL.
 */

