apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
#define I2C_SCL_FILTER_EN    (BIT(4))
#define I2C_SCL_FILTER_EN_M  (I2C_SCL_FILTER_EN_V << I2C_SCL_FILTER_EN_S)
#define I2C_SCL_FILTER_EN_V  0x00000001
#define I2C_SCL_FILTER_EN_S  4

/* I2C_SCL_FILTER_THRES : R/W; bitpos: [3:0]; default: 0;
 * When a pulse on the SCL input has smaller width than this register value
 * in I2C module clock cycles, the I2C controller will ignore that pulse.
 */

#define I2C_SCL_FILTER_THRES    0x0000000f
#define I2C_SCL_FILTER_THRES_M  (I2C_SCL_FILTER_THRES_V << I2C_SCL_FILTER_THRES_S)
#define I2C_SCL_FILTER_THRES_V  0x0000000f
#define I2C_SCL_FILTER_THRES_S  0

/* I2C_SDA_FILTER_CFG_REG register
 * SDA filter configuration register
 */

#define I2C_SDA_FILTER_CFG_REG(i) (REG_I2C_BASE(i) + 0x54)

/* I2C_SDA_FILTER_EN : R/W; bitpos: [4]; default: 1;
 * This is the filter enable bit for SDA.
 */

#define I2C_SDA_FILTER_EN    (BIT(4))
#define I2C_SDA_FILTER_EN_M  (I2C_SDA_FILTER_EN_V << I2C_SDA_FILTER_EN_S)
#define I2C_SDA_FILTER_EN_V  0x00000001
#define I2C_SDA_FILTER_EN_S  4

/* I2C_SDA_FILTER_THRES : R/W; bitpos: [3:0]; default: 0;
 * When a pulse on the SDA input has smaller width than this register value
 * in I2C module clock cycles, the I2C controller will ignore that pulse.
 */

#define I2C_SDA_FILTER_THRES    0x0000000f
#define I2C_SDA_FILTER_THRES_M  (I2C_SDA_FILTER_THRES_V << I2C_SDA_FILTER_THRES_S)
#define I2C_SDA_FILTER_THRES_V  0x0000000f
#define I2C_SDA_FILTER_THRES_S  0

/* I2C_COMD0_REG register
 * I2C command register 0
 */

#define I2C_COMD0_REG(i) (REG_I2C_BASE(i) + 0x58)

/* I2C_COMMAND0_DONE : R/W; bitpos: [31]; default: 0;
 * When command 0 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND0_DONE    (BIT(31))
#define I2C_COMMAND0_DONE_M  (I2C_COMMAND0_DONE_V << I2C_COMMAND0_DONE_S)
#define I2C_COMMAND0_DONE_V  0x00000001
#define I2C_COMMAND0_DONE_S  31

/* I2C_COMMAND0 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 0. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND0    0x00003fff
#define I2C_COMMAND0_M  (I2C_COMMAND0_V << I2C_COMMAND0_S)
#define I2C_COMMAND0_V  0x00003fff
#define I2C_COMMAND0_S  0

/* I2C_COMD1_REG register
 * I2C command register 1
 */

#define I2C_COMD1_REG(i) (REG_I2C_BASE(i) + 0x5c)

/* I2C_COMMAND1_DONE : R/W; bitpos: [31]; default: 0;
 * When command 1 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND1_DONE    (BIT(31))
#define I2C_COMMAND1_DONE_M  (I2C_COMMAND1_DONE_V << I2C_COMMAND1_DONE_S)
#define I2C_COMMAND1_DONE_V  0x00000001
#define I2C_COMMAND1_DONE_S  31

/* I2C_COMMAND1 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 1. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND1    0x00003fff
#define I2C_COMMAND1_M  (I2C_COMMAND1_V << I2C_COMMAND1_S)
#define I2C_COMMAND1_V  0x00003fff
#define I2C_COMMAND1_S  0

/* I2C_COMD2_REG register
 * I2C command register 2
 */

#define I2C_COMD2_REG(i) (REG_I2C_BASE(i) + 0x60)

/* I2C_COMMAND2_DONE : R/W; bitpos: [31]; default: 0;
 * When command 2 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND2_DONE    (BIT(31))
#define I2C_COMMAND2_DONE_M  (I2C_COMMAND2_DONE_V << I2C_COMMAND2_DONE_S)
#define I2C_COMMAND2_DONE_V  0x00000001
#define I2C_COMMAND2_DONE_S  31

/* I2C_COMMAND2 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 2. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND2    0x00003fff
#define I2C_COMMAND2_M  (I2C_COMMAND2_V << I2C_COMMAND2_S)
#define I2C_COMMAND2_V  0x00003fff
#define I2C_COMMAND2_S  0

/* I2C_COMD3_REG register
 * I2C command register 3
 */

#define I2C_COMD3_REG(i) (REG_I2C_BASE(i) + 0x64)

/* I2C_COMMAND3_DONE : R/W; bitpos: [31]; default: 0;
 * When command 3 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND3_DONE    (BIT(31))
#define I2C_COMMAND3_DONE_M  (I2C_COMMAND3_DONE_V << I2C_COMMAND3_DONE_S)
#define I2C_COMMAND3_DONE_V  0x00000001
#define I2C_COMMAND3_DONE_S  31

/* I2C_COMMAND3 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 3. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND3    0x00003fff
#define I2C_COMMAND3_M  (I2C_COMMAND3_V << I2C_COMMAND3_S)
#define I2C_COMMAND3_V  0x00003fff
#define I2C_COMMAND3_S  0

/* I2C_COMD4_REG register
 * I2C command register 4
 */

#define I2C_COMD4_REG(i) (REG_I2C_BASE(i) + 0x68)

/* I2C_COMMAND4_DONE : R/W; bitpos: [31]; default: 0;
 * When command 4 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND4_DONE    (BIT(31))
#define I2C_COMMAND4_DONE_M  (I2C_COMMAND4_DONE_V << I2C_COMMAND4_DONE_S)
#define I2C_COMMAND4_DONE_V  0x00000001
#define I2C_COMMAND4_DONE_S  31

/* I2C_COMMAND4 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 4. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND4    0x00003fff
#define I2C_COMMAND4_M  (I2C_COMMAND4_V << I2C_COMMAND4_S)
#define I2C_COMMAND4_V  0x00003fff
#define I2C_COMMAND4_S  0

/* I2C_COMD5_REG register
 * I2C command register 5
 */

#define I2C_COMD5_REG(i) (REG_I2C_BASE(i) + 0x6c)

