apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
/* I2C_COMMAND5_DONE : R/W; bitpos: [31]; default: 0;
 * When command 5 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND5_DONE    (BIT(31))
#define I2C_COMMAND5_DONE_M  (I2C_COMMAND5_DONE_V << I2C_COMMAND5_DONE_S)
#define I2C_COMMAND5_DONE_V  0x00000001
#define I2C_COMMAND5_DONE_S  31

/* I2C_COMMAND5 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 5. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND5    0x00003fff
#define I2C_COMMAND5_M  (I2C_COMMAND5_V << I2C_COMMAND5_S)
#define I2C_COMMAND5_V  0x00003fff
#define I2C_COMMAND5_S  0

/* I2C_COMD6_REG register
 * I2C command register 6
 */

#define I2C_COMD6_REG(i) (REG_I2C_BASE(i) + 0x70)

/* I2C_COMMAND6_DONE : R/W; bitpos: [31]; default: 0;
 * When command 6 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND6_DONE    (BIT(31))
#define I2C_COMMAND6_DONE_M  (I2C_COMMAND6_DONE_V << I2C_COMMAND6_DONE_S)
#define I2C_COMMAND6_DONE_V  0x00000001
#define I2C_COMMAND6_DONE_S  31

/* I2C_COMMAND6 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 6. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND6    0x00003fff
#define I2C_COMMAND6_M  (I2C_COMMAND6_V << I2C_COMMAND6_S)
#define I2C_COMMAND6_V  0x00003fff
#define I2C_COMMAND6_S  0

/* I2C_COMD7_REG register
 * I2C command register 7
 */

#define I2C_COMD7_REG(i) (REG_I2C_BASE(i) + 0x74)

/* I2C_COMMAND7_DONE : R/W; bitpos: [31]; default: 0;
 * When command 7 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND7_DONE    (BIT(31))
#define I2C_COMMAND7_DONE_M  (I2C_COMMAND7_DONE_V << I2C_COMMAND7_DONE_S)
#define I2C_COMMAND7_DONE_V  0x00000001
#define I2C_COMMAND7_DONE_S  31

/* I2C_COMMAND7 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 7. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND7    0x00003fff
#define I2C_COMMAND7_M  (I2C_COMMAND7_V << I2C_COMMAND7_S)
#define I2C_COMMAND7_V  0x00003fff
#define I2C_COMMAND7_S  0

/* I2C_COMD8_REG register
 * I2C command register 8
 */

#define I2C_COMD8_REG(i) (REG_I2C_BASE(i) + 0x78)

/* I2C_COMMAND8_DONE : R/W; bitpos: [31]; default: 0;
 * When command 8 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND8_DONE    (BIT(31))
#define I2C_COMMAND8_DONE_M  (I2C_COMMAND8_DONE_V << I2C_COMMAND8_DONE_S)
#define I2C_COMMAND8_DONE_V  0x00000001
#define I2C_COMMAND8_DONE_S  31

/* I2C_COMMAND8 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 8. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND8    0x00003fff
#define I2C_COMMAND8_M  (I2C_COMMAND8_V << I2C_COMMAND8_S)
#define I2C_COMMAND8_V  0x00003fff
#define I2C_COMMAND8_S  0

/* I2C_COMD9_REG register
 * I2C command register 9
 */

#define I2C_COMD9_REG(i) (REG_I2C_BASE(i) + 0x7c)

/* I2C_COMMAND9_DONE : R/W; bitpos: [31]; default: 0;
 * When command 9 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND9_DONE    (BIT(31))
#define I2C_COMMAND9_DONE_M  (I2C_COMMAND9_DONE_V << I2C_COMMAND9_DONE_S)
#define I2C_COMMAND9_DONE_V  0x00000001
#define I2C_COMMAND9_DONE_S  31

/* I2C_COMMAND9 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 9. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND9    0x00003fff
#define I2C_COMMAND9_M  (I2C_COMMAND9_V << I2C_COMMAND9_S)
#define I2C_COMMAND9_V  0x00003fff
#define I2C_COMMAND9_S  0

/* I2C_COMD10_REG register
 * I2C command register 10
 */

#define I2C_COMD10_REG(i) (REG_I2C_BASE(i) + 0x80)

/* I2C_COMMAND10_DONE : R/W; bitpos: [31]; default: 0;
 * When command 10 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND10_DONE    (BIT(31))
#define I2C_COMMAND10_DONE_M  (I2C_COMMAND10_DONE_V << I2C_COMMAND10_DONE_S)
#define I2C_COMMAND10_DONE_V  0x00000001
#define I2C_COMMAND10_DONE_S  31

/* I2C_COMMAND10 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 10. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND10    0x00003fff
#define I2C_COMMAND10_M  (I2C_COMMAND10_V << I2C_COMMAND10_S)
#define I2C_COMMAND10_V  0x00003fff
#define I2C_COMMAND10_S  0

/* I2C_COMD11_REG register
 * I2C command register 11
 */

#define I2C_COMD11_REG(i) (REG_I2C_BASE(i) + 0x84)

/* I2C_COMMAND11_DONE : R/W; bitpos: [31]; default: 0;
 * When command 11 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND11_DONE    (BIT(31))
#define I2C_COMMAND11_DONE_M  (I2C_COMMAND11_DONE_V << I2C_COMMAND11_DONE_S)
#define I2C_COMMAND11_DONE_V  0x00000001
#define I2C_COMMAND11_DONE_S  31

/* I2C_COMMAND11 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 11. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND11    0x00003fff
#define I2C_COMMAND11_M  (I2C_COMMAND11_V << I2C_COMMAND11_S)
#define I2C_COMMAND11_V  0x00003fff
#define I2C_COMMAND11_S  0

/* I2C_COMD12_REG register
 * I2C command register 12
 */

#define I2C_COMD12_REG(i) (REG_I2C_BASE(i) + 0x88)

/* I2C_COMMAND12_DONE : R/W; bitpos: [31]; default: 0;
 * When command 12 is done in I2C Master mode, this bit changes to high
 * level.
 */

