apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
#define I2C_COMMAND12_DONE    (BIT(31))
#define I2C_COMMAND12_DONE_M  (I2C_COMMAND12_DONE_V << I2C_COMMAND12_DONE_S)
#define I2C_COMMAND12_DONE_V  0x00000001
#define I2C_COMMAND12_DONE_S  31

/* I2C_COMMAND12 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 12. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND12    0x00003fff
#define I2C_COMMAND12_M  (I2C_COMMAND12_V << I2C_COMMAND12_S)
#define I2C_COMMAND12_V  0x00003fff
#define I2C_COMMAND12_S  0

/* I2C_COMD13_REG register
 * I2C command register 13
 */

#define I2C_COMD13_REG(i) (REG_I2C_BASE(i) + 0x8c)

/* I2C_COMMAND13_DONE : R/W; bitpos: [31]; default: 0;
 * When command 13 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND13_DONE    (BIT(31))
#define I2C_COMMAND13_DONE_M  (I2C_COMMAND13_DONE_V << I2C_COMMAND13_DONE_S)
#define I2C_COMMAND13_DONE_V  0x00000001
#define I2C_COMMAND13_DONE_S  31

/* I2C_COMMAND13 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 13. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND13    0x00003fff
#define I2C_COMMAND13_M  (I2C_COMMAND13_V << I2C_COMMAND13_S)
#define I2C_COMMAND13_V  0x00003fff
#define I2C_COMMAND13_S  0

/* I2C_COMD14_REG register
 * I2C command register 14
 */

#define I2C_COMD14_REG(i) (REG_I2C_BASE(i) + 0x90)

/* I2C_COMMAND14_DONE : R/W; bitpos: [31]; default: 0;
 * When command 14 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND14_DONE    (BIT(31))
#define I2C_COMMAND14_DONE_M  (I2C_COMMAND14_DONE_V << I2C_COMMAND14_DONE_S)
#define I2C_COMMAND14_DONE_V  0x00000001
#define I2C_COMMAND14_DONE_S  31

/* I2C_COMMAND14 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 14. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND14    0x00003fff
#define I2C_COMMAND14_M  (I2C_COMMAND14_V << I2C_COMMAND14_S)
#define I2C_COMMAND14_V  0x00003fff
#define I2C_COMMAND14_S  0

/* I2C_COMD15_REG register
 * I2C command register 15
 */

#define I2C_COMD15_REG(i) (REG_I2C_BASE(i) + 0x94)

/* I2C_COMMAND15_DONE : R/W; bitpos: [31]; default: 0;
 * When command 15 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND15_DONE    (BIT(31))
#define I2C_COMMAND15_DONE_M  (I2C_COMMAND15_DONE_V << I2C_COMMAND15_DONE_S)
#define I2C_COMMAND15_DONE_V  0x00000001
#define I2C_COMMAND15_DONE_S  31

/* I2C_COMMAND15 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 15. It consists of three parts:
 *
 * op_code is the command, 0: RSTART. 1: WRITE. 2: READ. 3: STOP. 4: END.
 *
 * byte_num represents the number of bytes that need to be sent or received.
 *
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more information.
 */

#define I2C_COMMAND15    0x00003fff
#define I2C_COMMAND15_M  (I2C_COMMAND15_V << I2C_COMMAND15_S)
#define I2C_COMMAND15_V  0x00003fff
#define I2C_COMMAND15_S  0

/* I2C_SCL_ST_TIME_OUT_REG register
 * SCL status time out register
 */

#define I2C_SCL_ST_TIME_OUT_REG(i) (REG_I2C_BASE(i) + 0x98)

/* I2C_SCL_ST_TO : R/W; bitpos: [23:0]; default: 256;
 * The threshold value of SCL_FSM state unchanged period.
 */

#define I2C_SCL_ST_TO    0x00ffffff
#define I2C_SCL_ST_TO_M  (I2C_SCL_ST_TO_V << I2C_SCL_ST_TO_S)
#define I2C_SCL_ST_TO_V  0x00ffffff
#define I2C_SCL_ST_TO_S  0

/* I2C_SCL_MAIN_ST_TIME_OUT_REG register
 * SCL main status time out register
 */

#define I2C_SCL_MAIN_ST_TIME_OUT_REG(i) (REG_I2C_BASE(i) + 0x9c)

/* I2C_SCL_MAIN_ST_TO : R/W; bitpos: [23:0]; default: 256;
 * The threshold value of SCL_MAIN_FSM state unchanged period.
 */

#define I2C_SCL_MAIN_ST_TO    0x00ffffff
#define I2C_SCL_MAIN_ST_TO_M  (I2C_SCL_MAIN_ST_TO_V << I2C_SCL_MAIN_ST_TO_S)
#define I2C_SCL_MAIN_ST_TO_V  0x00ffffff
#define I2C_SCL_MAIN_ST_TO_S  0

/* I2C_SCL_SP_CONF_REG register
 * Power configuration register
 */

#define I2C_SCL_SP_CONF_REG(i) (REG_I2C_BASE(i) + 0xa0)

/* I2C_SDA_PD_EN : R/W; bitpos: [7]; default: 0;
 * The power down enable bit for the I2C output SDA line. 1: Power down. 0:
 * Not power down. Set I2C_SDA_FORCE_OUT and I2C_SDA_PD_EN to 1 to stretch
 * SDA low.
 */

#define I2C_SDA_PD_EN    (BIT(7))
#define I2C_SDA_PD_EN_M  (I2C_SDA_PD_EN_V << I2C_SDA_PD_EN_S)
#define I2C_SDA_PD_EN_V  0x00000001
#define I2C_SDA_PD_EN_S  7

/* I2C_SCL_PD_EN : R/W; bitpos: [6]; default: 0;
 * The power down enable bit for the I2C output SCL line. 1: Power down. 0:
 * Not power down. Set I2C_SCL_FORCE_OUT and I2C_SCL_PD_EN to 1 to stretch
 * SCL low.
 */

#define I2C_SCL_PD_EN    (BIT(6))
#define I2C_SCL_PD_EN_M  (I2C_SCL_PD_EN_V << I2C_SCL_PD_EN_S)
#define I2C_SCL_PD_EN_V  0x00000001
#define I2C_SCL_PD_EN_S  6

/* I2C_SCL_RST_SLV_NUM : R/W; bitpos: [5:1]; default: 0;
 * Configure the pulses of SCL generated in I2C master mode. Valid when
 * I2C_SCL_RST_SLV_EN is 1.
 */

#define I2C_SCL_RST_SLV_NUM    0x0000001f
#define I2C_SCL_RST_SLV_NUM_M  (I2C_SCL_RST_SLV_NUM_V << I2C_SCL_RST_SLV_NUM_S)
#define I2C_SCL_RST_SLV_NUM_V  0x0000001f
#define I2C_SCL_RST_SLV_NUM_S  1

/* I2C_SCL_RST_SLV_EN : R/W; bitpos: [0]; default: 0;
 * When I2C master is IDLE, set this bit to send out SCL pulses. The number
 * of pulses equals to I2C_SCL_RST_SLV_NUM[4:0].
 */

#define I2C_SCL_RST_SLV_EN    (BIT(0))
#define I2C_SCL_RST_SLV_EN_M  (I2C_SCL_RST_SLV_EN_V << I2C_SCL_RST_SLV_EN_S)
#define I2C_SCL_RST_SLV_EN_V  0x00000001
#define I2C_SCL_RST_SLV_EN_S  0

