apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_i2c.h
/* I2C_SCL_STRETCH_CONF_REG register
 * Set SCL stretch of I2C slave
 */

#define I2C_SCL_STRETCH_CONF_REG(i) (REG_I2C_BASE(i) + 0xa4)

/* I2C_SLAVE_SCL_STRETCH_CLR : WO; bitpos: [11]; default: 0;
 * Set this bit to clear the I2C slave SCL stretch function.
 */

#define I2C_SLAVE_SCL_STRETCH_CLR    (BIT(11))
#define I2C_SLAVE_SCL_STRETCH_CLR_M  (I2C_SLAVE_SCL_STRETCH_CLR_V << I2C_SLAVE_SCL_STRETCH_CLR_S)
#define I2C_SLAVE_SCL_STRETCH_CLR_V  0x00000001
#define I2C_SLAVE_SCL_STRETCH_CLR_S  11

/* I2C_SLAVE_SCL_STRETCH_EN : R/W; bitpos: [10]; default: 0;
 * The enable bit for slave SCL stretch function. 1: Enable. 0: Disable. The
 * SCL output line will be stretched low when I2C_SLAVE_SCL_STRETCH_EN is 1
 * and stretch event happens. The stretch cause can be seen in
 * I2C_STRETCH_CAUSE.
 */

#define I2C_SLAVE_SCL_STRETCH_EN    (BIT(10))
#define I2C_SLAVE_SCL_STRETCH_EN_M  (I2C_SLAVE_SCL_STRETCH_EN_V << I2C_SLAVE_SCL_STRETCH_EN_S)
#define I2C_SLAVE_SCL_STRETCH_EN_V  0x00000001
#define I2C_SLAVE_SCL_STRETCH_EN_S  10

/* I2C_STRETCH_PROTECT_NUM : R/W; bitpos: [9:0]; default: 0;
 * Configure the period of I2C slave stretching SCL line.
 */

#define I2C_STRETCH_PROTECT_NUM    0x000003ff
#define I2C_STRETCH_PROTECT_NUM_M  (I2C_STRETCH_PROTECT_NUM_V << I2C_STRETCH_PROTECT_NUM_S)
#define I2C_STRETCH_PROTECT_NUM_V  0x000003ff
#define I2C_STRETCH_PROTECT_NUM_S  0

/* I2C_DATE_REG register
 * Version control register
 */

#define I2C_DATE_REG(i) (REG_I2C_BASE(i) + 0xf8)

/* I2C_DATE : R/W; bitpos: [31:0]; default: 419766272;
 * This is the version control register.
 */

#define I2C_DATE    0xffffffff
#define I2C_DATE_M  (I2C_DATE_V << I2C_DATE_S)
#define I2C_DATE_V  0xffffffff
#define I2C_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_I2C_H */
